app/Http/Controllers/Blog/CategoryController.php

    public function index()
    {
        $categories = Category::with('subcategories')->get();
---
select * from `categories` where `categories`.`deleted_at` is null

    public function create()
    {
        $parentCategories = Category::where('parent_id', null)->get();
---
select * from `categories` where `parent_id` is null

    public function show(Category $category)
    {
        $category->load('parent')->loadCount('subcategories');
---
select * from `categories` where `categories`.`id` in (3) and `categories`.`deleted_at` is null

    public function edit(Category $category)
    {
        $parentCategories = Category::where('parent_id', null)->get();
---
select * from `categories` where `parent_id` is null

    public function update(UpdateCategoryRequest $request, Category $category)
    {
        $category->update($request->validated());
---
update `categories` set `description` = 'sdsad as dsad as', `keywords` = 'd asdas das d asd  as', `parent_id` = '3', `categories`.`updated_at` = '2021-09-30 08:49:22' where `id` = 2

    public function destroy(Category $category)
    {
        $category->delete();
---
delete from `categories` where `id` = 1
update `categories` set `deleted_at` = '2021-09-30 11:08:19', `categories`.`updated_at` = '2021-09-30 11:08:19' where `id` = 3