app/Http/Controllers/Blog/PostController.php

    public function index()
    {
        $posts = Post::all();
---
select * from `posts` where `posts`.`deleted_at` is null

    public function create()
    {
        $categories = Category::with('subcategories')->get();
---
select * from `categories`

    public function edit(Post $post)
    {
        $categories = Category::with('subcategories')->get();
---
select * from `categories`

    public function update(Request $request, Post $post)
    {
        $post->update($request->all());
---
update `posts` set `title` = 'testowy post', `description` = 'testowy opis', `keywords` = 'test opis', `body` = 'testowa treść', `published_at` = '2020-10-29 20:38:0', `category_id` = '8', `posts`.`updated_at` = '2021-09-30 10:55:06' where `id` = 1

    public function destroy(Post $post)
    {
        $post->delete();
---
update `posts` set `deleted_at` = '2021-09-30 11:02:55', `posts`.`updated_at` = '2021-09-30 11:02:55' where `id` = 1